<?php

use Illuminate\Database\Seeder;

class BaseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('v2_games')->insert([
            'name' => 'base'
        ]);

        DB::table('v2_game_rules')->insert([
            'game_id' => 1,
            'name' => 'percentages',
            'rules' => '[{"bet":0,"mainGame":[[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10]],"featureGame":[[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10]]},{"bet":25,"mainGame":[[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10]],"featureGame":[[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10],[9,9,9,9,9,9,9,9,9,9,10]]}]'
        ]);

        DB::table('v2_game_rules')->insert([
            'game_id' => 1,
            'name' => 'winCombinations',
            // недостаток, что должны идти по порядку и если у какого то симола нет выигрышной комбинации, то нужно ставить [0,0,0,0,0,0]
            'rules' => '[[0,0,0,0,0,0], [0,0,10,50,500,5000], [0,0,0,5,25,120], [0,0,0,10,50,200], [0,0,0,20,100,500], [0,0,0,15,75,200], [0,0,0,10,30,150], [0,0,0,5,30,150], [0,0,0,5,20,100], [0,0,5,30,200,1000], [0,0,0,0,0,0]]' // [[symbol => [count => winValue, ... ], ...]
        ]);

        DB::table('v2_game_rules')->insert([
            'game_id' => 1,
            'name' => 'lines',
            'rules' => '[[1,4,7,10,13],[0,3,6,9,12],[2,5,8,11,14],[0,4,8,10,12],[2,4,6,10,14],[1,3,7,11,13],[1,5,7,9,13],[0,3,7,11,14],[2,5,7,9,12],[0,4,6,10,12],[2,4,8,10,14],[1,3,6,9,13],[1,5,8,11,13],[0,4,7,10,12],[2,4,7,10,14]]' // [[cellNumber, cellNumber, cellNumber, cellNumber, cellNumber], ...]
        ]);

        DB::table('v2_game_rules')->insert([
            'game_id' => 1,
            'name' => 'bonus',
            // bonus может быть как итоговым значением, так и множителем в зависимости от внутренней логики определенной игры
            'rules' => '[[0,0,0,0,0,0], [0,0,0,0,0,0], [0,0,0,0,0,0], [0,0,0,0,0,0], [0,0,0,0,0,0], [0,0,0,0,0,0], [0,0,0,0,0,0], [0,0,0,0,0,0], [0,0,0,0,0,0], [0,0,0,0,0,0], [0,0,0,2,15,100]]' // [[symbol => [count => winValue, ... ], ...]
        ]);

        DB::table('v2_game_rules')->insert([
            'game_id' => 1,
            'name' => 'featureGame',
            'rules' => '[10, 3]' // ['symbol' => , 'minAmount' => ]
        ]);
    }
}
